from aiogram import Router, F
from aiogram.filters import CommandStart
from aiogram.types import Message, FSInputFile, CallbackQuery

from app.start.keyboard import start_keyboard
from app.utils import get_user
from core.models import db_helper

router = Router()

@router.message(CommandStart())
async def cmd_start(message: Message):
    async with db_helper.scoped_session_dependency() as session:
        await get_user(session, message.from_user.id, message.from_user.username)
        video = FSInputFile("media/start.MOV")
        return await message.answer_video(video=video, caption="""🎬 Добро пожаловать в Kidai!

Представь: ты нарисовал героя, а он вдруг ожил! ✨

Теперь ты можешь сам создавать мультфильмы из своих картинок.

🎨 Загрузи рисунок.

🎥 Запусти волшебство.

🌈 Получи собственное видео.

👇 Начни своё приключение!""", parse_mode="HTML", reply_markup=start_keyboard())


@router.callback_query(F.data == "privacy_police")
async def callback_privacy_police(callback: CallbackQuery):
    async with db_helper.scoped_session_dependency() as session:
        user = await get_user(session, callback.from_user.id, callback.from_user.username)

    return await callback.message.answer("""
<i><u>17.10.2026</u></i>

Политика конфиденциальности регулирует сбор, использование и защиту информации пользователей сервиса. Собираются идентификаторы аккаунта, техническая информация и история взаимодействий. Данные используются для обеспечения работы сервиса, связи с пользователем и анализа. Передача информации третьим лицам возможна только в законодательно установленных случаях или с согласия пользователя. Хранение данных осуществляется в течение необходимого срока, их защита — в разумных пределах. Пользователь самостоятельно несёт ответственность за риски, связанные с передачей данных. Администрация вправе вносить изменения в Политику без уведомления — согласие считается принятым при дальнейшем использовании сервиса.

<b>1. Общие положения</b>

1.1. Настоящая Политика конфиденциальности (далее — «Политика») регулирует порядок обработки и защиты информации, которую Пользователь передаёт при использовании сервиса ваш сайт/ тг бот(далее — «Сервис»).

1.2. Используя Сервис, Пользователь подтверждает своё согласие с условиями Политики. Если Пользователь не согласен с условиями — он обязан прекратить использование Сервиса.

<b>2. Сбор информации</b>

2.1. Сервис может собирать следующие типы данных:

идентификаторы аккаунта (логин, ID, никнейм и т.п.);

техническую информацию (IP-адрес, данные о браузере, устройстве и операционной системе);

историю взаимодействий с Сервисом.

2.2. Сервис не требует от Пользователя предоставления паспортных данных, документов, фотографий или другой личной информации, кроме минимально необходимой для работы.

<b>3. Использование информации</b>

3.1. Сервис может использовать полученную информацию исключительно для:

обеспечения работы функционала;

связи с Пользователем (в том числе для уведомлений и поддержки);

анализа и улучшения работы Сервиса.

<b>4. Передача информации третьим лицам</b>

4.1. Администрация не передаёт полученные данные третьим лицам, за исключением случаев:

если это требуется по закону;

если это необходимо для исполнения обязательств перед Пользователем (например, при работе с платёжными системами);

если Пользователь сам дал на это согласие.

<b>5. Хранение и защита данных</b>

5.1. Данные хранятся в течение срока, необходимого для достижения целей обработки.

5.2. Администрация принимает разумные меры для защиты данных, но не гарантирует абсолютную безопасность информации при передаче через интернет.

<b>6. Отказ от ответственности</b>

6.1. Пользователь понимает и соглашается, что передача информации через интернет всегда сопряжена с рисками.

6.2. Администрация не несёт ответственности за утрату, кражу или раскрытие данных, если это произошло по вине третьих лиц или самого Пользователя.

<b>7. Изменения в Политике</b>

7.1. Администрация вправе изменять условия Политики без предварительного уведомления.

7.2. Продолжение использования Сервиса после внесения изменений означает согласие Пользователя с новой редакцией Политики.""",
                                         parse_mode="HTML",)

